import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

# 生成示例数据
# data = np.array([
#     [0.3650, 0.2452, 0.1924, 0.1975],
#     [0.1515, 0.5130, 0.1611, 0.1745],
#     [0.1626, 0.2207, 0.4302, 0.1865],
#     [0.1556, 0.2134, 0.1663, 0.4647]])

# data = np.array([
#     [0.3704, 0.3049, 0.1770, 0.1477],
#     [0.1755, 0.5202, 0.1599, 0.1444],
#     [0.1842, 0.2456, 0.4187, 0.1515],
#     [0.1881, 0.2518, 0.1732, 0.3869]
# ])

data = np.array([
    [0.3880, 0.2338, 0.1979, 0.1802],
    [0.1712, 0.4917, 0.1707, 0.1665],
    [0.1790, 0.2059, 0.4443, 0.1708],
    [0.1746, 0.2116, 0.1777, 0.4362]
])





# 绘制热力图
plt.figure()
sns.heatmap(data, cmap='BuGn', annot=True)
plt.title('Attention weights heatmap')
plt.show()
